Dlubal.DynamPro.DLCEfaParams
Dynamic load case - equivalent force analysis parameters

Dlubal.DynamPro.DLCEfaParams.RSAssignment
Response spectrum assignment

Dlubal.DynamPro.DLCEfaParams.ConsiderAccidentalTorsion
Consider accidental torsional actions

Dlubal.DynamPro.DLCEfaParams.EccentricityX
Eccentricity eX [m]

Dlubal.DynamPro.DLCEfaParams.EccentricityY
Eccentricity eY [m]

Dlubal.DynamPro.DLCEfaParams.ModalResponseCombinationRule
Modal response combination rule

Dlubal.DynamPro.DLCEfaParams.UseEquivalentLinearCombination
Use equivalent linear combination

Dlubal.DynamPro.DLCEfaParams.SignedResultsUsingDominantMode
Signed results using dominant mode

Dlubal.DynamPro.DLCEfaParams.SignedResultsModeShapeX
What mode shape to use for signed results in direction X (0=Automatic)

Dlubal.DynamPro.DLCEfaParams.SignedResultsModeShapeY
What mode shape to use for signed results in direction Y (0=Automatic)

Dlubal.DynamPro.DLCEfaParams.SignedResultsModeShapeZ
What mode shape to use for signed results in direction Z (0=Automatic)

Dlubal.DynamPro.DLCEfaParams.GenerateLoadCases
Generate load cases

Dlubal.DynamPro.DLCEfaParams.FirstLoadCaseNo
Number of the first generated load case (if possible)

Dlubal.DynamPro.DLCEfaParams.GenerateResultCombination
Generate result combination

Dlubal.DynamPro.DLCEfaParams.FirstResultCombinationNo
Number of the first generated result combination (if possible)

Dlubal.DynamPro.DLCEfaParams.CombinationOfDirectionalComponents
Enable combination of directional components

Dlubal.DynamPro.DLCEfaParams.DirectionalCombiningRule
Directional combining rule